Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/youthreach.html.txt.tmx
Source language: en
Languages: ga

source: If you have left school without any formal qualifications, the Youthreach programme can provide you with opportunities for basic education, personal development, vocational training and work experience
ga: Má d'fhág tú an scoil gan aon chailíochtaí foirmiúla, tá deiseanna ar fáil ó chlár Ógtheagmhála bunoideachas, forbairt phearsanta, oiliúint ghairmoideachais agus taithí oibre a fháil

source: The programme is generally full-time, although part-time courses can be arranged
ga: Clár lán-aimseartha atá ann den chuid is mó, ach is féidir cúrsaí páirtaimseartha a shocrú

source: You can concentrate on a core training area of your choice but basic subjects, such as English, maths and life skills, are generally covered by all trainees
ga: Is féidir béim a leagan ar do rogha príomhábhar oiliúna ach beidh bunábhair, ar nós an Bhéarla, na matamaitice agus scileanna saoil, clúdaithe go ginearálta ag gach oiliúnóir

source: Opportunities to improve literacy and numeracy are available at all Youthreach centres
ga: Tá deis feabhas a chur ar scileanna litearthachta agus uimhearthachta ar fáil ag na hionaid Ógtheagmhála ar fad

source: The course generally lasts from 1 to 2 years, although it can be flexible, depending on your individual needs
ga: Is gnách go maireann an cúrsa idir 1 agus 2 bhliain ach is féidir leis a bheith solúbtha, ag brath ar do riachtanais aonair

source: If you complete the basic training successfully, you will be awarded a Foundation Certification from Quality and Qualifications Ireland (QQI) or the Junior Certificate
ga: Má éiríonn leat an bhunoiliúint a chríochnú, bronnfar Bonnteastas (ó Dhearbhú Cáilíochta agus Cáilíochtaí Éireann (QQI) nó Teastas Sóisearach ort)

source: Having completed a Foundation Programme, you may continue to a Progression Programme
ga: Má tá Bonnchlár críochnaithe agat, is féidir leat dul ar aghaidh agus tabhairt faoi Chlár Fochéimnithe

source: This will give you the opportunity to progress to the Leaving Certificate Applied course or a higher-level QQI award or you can choose to continue other skills training, such as an apprenticeship course
ga: Tabharfaidh sé seo an deis duit dul ar aghaidh agus tabhairt faoin Ardteistiméireacht Fheidhmeach nó faoi ardchúrsa QQI nó is féidir leat roghnú dul ar aghaidh agus oiliúint i scileanna eile a dhéanamh, mar shampla, is féidir leat cúrsa printíseachta a dhéanamh

source: The courses take place in Youthreach centres managed by Education and Training Boards (ETBs) and Community Training Centres
ga: Bíonn na cúrsaí á reáchtáil in ionaid Ógtheagmhála atá á mbainistiú ag Boird Oideachais agus Oiliúna (BOOanna) agus in Ionaid Oiliúna Pobail

source: Generally, Youthreach centres are open for 35 hours per week (9 a.m. - 4.30 p.m., Monday to Friday)
ga: Go ginearálta, bíonn ionaid Ógtheagmhála oscailte ar feadh 35 uair a chloig sa tseachtain (9am-4.30pm ó Luan go hAoine)

source: If you qualify for Youthreach, you may also be eligible for the Back to Education Initiative
ga: Má cháilíonn tú d’Ógtheagmháil, d’fhéadfá bheith i dteideal bheith páirteach sa Tionscnamh um Fhilleadh ar Oideachas

source: Education and Training Boards
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ón 1 Iúil 2013, tháinig Boird Oideachais agus Oiliúna (BOOanna) in ionad Coistí Gairmoideachais (VECanna)

source: All services provided by VECs will continue to be provided by ETBs
ga: Leanfaidh na BOOanna leis an uile sheirbhís a sholáthraíonn VECanna a chur ar fáil

source: FÁS training centres have also transferred to ETBs
ga: Aistreofar Ionaid Oiliúna Pobail go dtí BOOanna ar bhonn céimnithe ar aon dul le bunú SOLAS

source: The criteria you must meet to access the Youthreach programme depends on whether you apply to a Youthreach centre managed by an Education and Training Board (ETB) or a Community Training Centre
ga: Braitheann na critéir nach mór duit a chomhlíonadh chun an clár Ógtheagmhála a rochtain ar cibé acu an ndéanann tú iarratas ag ionad Ógtheagmhála atá á bhainistiú ag Bord Oideachais agus Oiliúna (BOO) nó ag Ionad Oiliúna Pobail

source: To be eligible for Youthreach provided by your local ETB, you should be between 15 and 20 years of age
ga: Le bheith i dteideal bheith páirteach in Ógtheagmháil a sholáthraíonn do BOO áitiúil, ba cheart duit bheith idir 15 agus 20 bliain d’aois

source: You must be unemployed and an early school leaver without any vocational training and who has not attempted the Leaving Certificate
ga: Ní mór duit bheith dífhostaithe agus bheith mar luathfhágóir scoile, agus ní mór nár cuireadh aon oiliúint gairmoideachais ort agus nár thug tú faoin Ardteistiméireacht

source: Some exceptions can be made to this rule, for example if you are a lone parent
ga: Féadtar eisceachtaí áirithe a dhéanamh i leith na rialach seo, mar shampla, más tuismitheoir aonair thú

source: Community Training Centre Youthreach programme
ga: Clár Ógtheagmhála Ionad Oiliúna Pobail

source: To be eligible for Youthreach provided by your local Community Training Centre, you should be between 16 and 21 years of age
ga: Le bheith i dteideal bheith páirteach in Ógtheagmháil a sholáthraíonn d’Ionad Oiliúna Pobail áitiúil, ba cheart duit bheith idir 16 agus 21 bliain d’aois

source: However, young people under the age of 25 who are disadvantaged and unemployed may attend the programme with agreement from SOLAS
ga: Féadfaidh daoine óga faoi 25 bliain d’aois atá faoi mhíbhuntáiste agus atá dífhostaithe freastal ar an gclár, áfach, tar éis go ndéanann SOLAS comhaontú air seo

source: The training on offer varies from centre to centre, often depending on the facilities available
ga: Braitheann an oiliúint a bhíonn ar fáil ó ionad go hionad, agus braitheann sé ar na háiseanna atá ar fáil go minic

source: If you have an interest in a particular career, you should look around for a centre offering a suitable course rather than applying automatically to the centre nearest to you
ga: Más spéis leat gairm ar leith, ba cheart duit ionad a aimsiú ina gcuirtear ar fáil cúrsa oiriúnach, seachas iarratas a dhéanamh láithreach bonn ar an ionad is giorra duit

source: Participants leaving Youthreach can apply for a jobseeker’s payment
ga: Is féidir le rannpháirtithe ag fágáil Youthreach cur isteach ar an íocaíocht cuardaitheora poist

source: The 3 month disqualification rule which applies to many students does not apply to Youthreach participants
ga: Ní bhaineann an riail dhícháilithe trí mhí le rannpháirtithe Youthreach

source: Courses are free and trainees aged over 16 receive a weekly allowance
ga: Tá an cúrsa saor in aisce agus tugtar liúntas seachtainiúil d’oiliúnaithe atá os cionn 16 bliana d’aois

source: You will get a travel allowance if you have to travel 5 km or more to the centre
ga: Gheobhaidh tú liúntas taistil má tá ort breis agus 4.9km a thaisteal chuig an ionad

source: You may also qualify for free childcare and a meal allowance - you should check with the centre
ga: Anuas air sin, d’fhéadfá cáiliú freisin do chúram leanaí agus do liúntas béilí – ba cheart duit seiceáil leis an ionad

source: The 2016 weekly allowances are as follows:
ga: Is iad seo a leanas liúntais sheachtainiúla 2016:

source: Trainee(s) maximum payment per week
ga: 16 bliana d’aois €40 (iontrálaithe nua)

source: 18 years and over €160.00 (with some exceptions)
ga: 18 mbliana d’aois agus níos sine €160 (roinnt eisceachtaí i gceist)

source: If you are over 18 years of age and you are currently getting a social welfare payment of more than €160, you will continue to get the higher amount while you are on Youthreach as long as you are eligible
ga: Má tá tú os cionn 18 mbliana d’aois agus má tá íocaíocht leasa shóisialaigh breis agus €160 á fáil agat, leanfaidh tú leis an tsuim níos airde a fháil fad a bhíonn tú páirteach in Ógtheagmháil a fhad a bhíonn tú i dteideal

source: If you were getting a reduced age-related Jobseeker's Allowance (JA) before starting Youthreach any means that were deducted from your JA will also be deducted from your training allowance
ga: Má bhí Liúntas Cuardaitheora Poist laghdaithe aoischoibhneasa (LCP) á fháil agat sular thosaigh tú le hÓgtheagmháil, asbhainfear aon mhaoin a asbhaineadh ó do LCP ó do liúntas oiliúna chomh maith

source: This also applies to people getting a reduced age-related basic Supplementary Welfare Allowance (SWA)
ga: Baineann seo le daoine a bhfuil Liúntas Leasa Fhorlíontaigh bunúsach aoischoibhneasa (LLF) á fháil acu

source: Youthreach courses are held year-round and you can apply to join a course at any time
ga: Bíonn cúrsaí Ógtheagmhála ar siúl i rith na bliana go léir, agus is féidir leat clárú le haghaidh cúrsa ag aon tráth ar bith

source: Contact your local Youthreach centre or Community Training Centre and talk to staff about your training needs and interests
ga: Déan teagmháil le d’ionad áitiúil Ógtheagmhála nó le d’Ionad Oiliúna Pobail agus labhair leis an bhfoireann faoi do chuid riachtanais oiliúna agus faoi na hábhair is díol spéise duit

source: You can also contact your local employment services office or ETB
ga: Chomh maith leis sin, féadfaidh tú teagmháil a dhéanamh le d’oifig áitiúil seirbhísí fostaíochta nó le BOO

source: Staff members are available at these centres to help you with application forms if necessary
ga: Tá fáil ar chomhaltaí foirne ag na hionaid seo chun cabhrú leat le foirmeacha iarratais, más gá
